# Эмитация БД товаров

dummy_db = [
    {
        'title': 'Восстановленный Apple Смартфон iPhone 13 4/256 ГБ, белый',
        'caption': '''Смартфон Apple iPhone 13 - это одна из самых надежных моделей от компании Apple.
                    Он является идеальным выбором для тех, кто ищет мощный и функциональный телефон.
                    iPhone 13 обладает большим объемом памяти, позволяющим хранить множество фотографий, видеозаписей, музыки и приложений без необходимости постоянного удаления данных.
                    
                    Телефон функционально как новый (восстановленный) с идеальным внешним видом полностью готов к использованию.
                    
                    Любое взаимодействие с водой запрещено!
                    
                    Смартфон Apple iPhone 13 отличается своим элегантным и компактным дизайном, что делает его очень стильным. Передовые технологии и высокая производительность позволяют ему легко справляться с любыми задачами.
                    Это очень надежный телефон!
                    
                    Одно из главных преимуществ айфон 13 - удобство использования.
                    Он имеет простой и интуитивно понятный интерфейс, а также многофункциональность, позволяющую использовать смартфон для различных целей. Он совместим с другими устройствами Apple, что делает его еще более удобным для пользователей, уже имеющих продукты от Apple.
                    
                    Качество и надежность - это одни из ключевых характеристик продукции от компании Apple.
                    Поэтому можно быть уверенным в долговременной работе смартфона без сбоев и проблем.
                    
                    Смартфон Apple iPhone 13 поддерживает русский язык и полностью адаптирован для рынка РФ и СНГ.
                    Состояние телефона: RFB
                    Внешний вид - идеальный. Емкость АКБ 100%.
                    В комплектацию так же входят - Чехол и стекло!
                    Гарантия: 1 год
                    Любые вопросы конструктивно и оперативно решаем в чате каждый день без выходных.
                    Хороших Вам покупок на Озоне!''',
    },
    {
        'title': 'Восстановленный Apple Смартфон iPhone 13  4/256 ГБ, белый',
        'caption': '''iPhone 13  — это идеальный выбор для тех, кто ищет компактный и мощный смартфон. Несмотря на то, что эта модель была выпущена несколько лет назад, она до сих пор остаётся актуальной и востребованной.

                    iPhone 13  оснащён мощным процессором A15 Bionic, который обеспечивает быструю и плавную работу устройства. Даже фишки современной iOS работают на сверхвысоких скоростях.
                    
                    Вы сможете легко запускать любые приложения, играть в игры и выполнять другие задачи без каких-либо задержек.
                    
                    Камера iPhone 13  позволяет делать яркие и чёткие фотографии даже в условиях недостаточного освещения. Вы сможете запечатлеть все важные моменты вашей жизни и сохранить их в высоком качестве. Видео же, снятые на iPhone 13 , также отличаются высоким качеством. Создавайте профессиональные видеоролики, которые будут радовать вас и ваших друзей или делитесь контентом со всем миром и нами в отзывах :)
                    
                    Управляй этим смартфоном, движением всего одного пальца.
                    iPhone 13  имеет небольшой размер и вес, что делает его удобным в использовании. Вы сможете легко носить его в кармане или сумке, не ощущая дискомфорта.
                    
                    Долговечность и надёжность, iPhone 13  изготовлен из высококачественных материалов, которые обеспечивают ему долговечность и надёжность. Вы можете быть уверены, что ваш смартфон прослужит долгое время. Несмотря на то, что iPhone 13  является восстановленным, он всё так же хорош и надёжен. Восстановленные смартфоны проходят тщательную проверку и ремонт, чтобы обеспечить их работоспособность и безопасность. Они ничем не уступают новым устройствам по качеству и функциональности.
                    
                    Если вы ищете компактный, мощный и надёжный смартфон, то iPhone 13  — отличный выбор. Он позволит вам наслаждаться всеми преимуществами современных технологий, не жертвуя при этом удобством и стилем.''',
    },
    {
        'title': 'Apple Смартфон iPhone 13 128 ГБ, темно-синий',
        'caption': '''Данная модель могла быть предварительно активирована. Является абсолютно новой, не проходила процедуру привязки аккаунта Apple ID. 
                    Обращаем ваше внимание, указанная выше информация не влияет на потребительские характеристики, функциональность и гарантию М.Видео. 
                    
                    iPhone 13. Сильный мира всего.
                    
                    iPhone 13. Самая совершенная система двух камер на iPhone. Режим Киноэффект делает из видео настоящее кино. Супербыстрый чип A15 Bionic. Неутомимый аккумулятор. Прочный корпус. И ещё более яркий дисплей Super Retina XDR.
                    
                    Основные характеристики
                    • Дисплей Super Retina XDR 6,1 дюйма
                    • Режим Киноэффект автоматически переводит фокус между объектами при съёмке видео и создаёт красивый эффект размытия
                    • Передовая система двух камер 12 Мп (широкоугольная и сверхширокоугольная); Фотографические стили, Smart HDR 4, Ночной режим, съёмка HDR-видео 4K в стандарте Dolby Vision
                    • Фронтальная камера TrueDepth 12 Мп: Ночной режим, съёмка HDR‑видео 4K в стандарте Dolby Vision
                    • A15 Bionic - чип, с которым всё супербыстро
                    • До 19 часов воспроизведения видео
                    • Панель Ceramic Shield для повышенной прочности
                    • Надёжная защита от воды (IP68)
                    • iOS 15 с новыми функциями, расширяющими возможности iPhone
                    • Поддержка аксессуаров MagSafe, которые легко крепятся и обеспечивают более быструю беспроводную зарядку''',
    },
    {
        'title': 'Apple Ноутбук 13.6", Apple M4, RAM 16 ГБ, SSD 256 ГБ, Apple M4 GPU (8-core), MacOS, (A3240), голубой, Английская раскладка',
        'caption': '''
                Apple MacBook Air 13" M4, 16/256Gb (10 CPU/8 GPU)
                
                Английская гравировка
                
                macOS — самая передовая операционная система для настольных компьютеров в мире. macOS Sequoia поможет вам продуктивно и креативно работать по-новому — с помощью Apple Intelligence, iPhone Mirroring,  оконного мозаики, крупных обновлений Safari и многого другого.
                
                Apple Intelligence — это персональная интеллектуальная система, которая помогает вам писать, выражать себя и выполнять задачи без усилий. Благодаря новаторской защите конфиденциальности вы можете быть уверены, что никто другой не сможет получить доступ к вашим данным — даже Apple.
                
                - Дисплей
                
                Дисплей Liquid Retina с диагональю 13,6 дюйма и светодиодной подсветкой, технологией IPS. Обственное разрешение 2560x1664  при плотности 224 пикселей на дюйм.
                
                Яркость 500 нит. Поддержка 1 миллиарда цветов. Широкий цвет (P3). Технология True Tone.
                
                - Аккумулятор
                
                До 18 часов потокового видео. До 15 часов беспроводного интернета.
                
                Встроенный литий-полимерный аккумулятор емкостью 53,8 Вт·ч.
                
                Адаптер питания USB-C мощностью 30 Вт. Кабель USB-C — MagSafe 3.
                
                Возможность быстрой зарядки с помощью адаптера питания USB-C мощностью 70 Вт.
                
                - Порты
                
                Порт зарядки MagSafe 3; 3,5 мм разъем для наушников; Два порта Thunderbolt 4 (USB-C) с поддержкой: Зарядка, DisplayPort, Thunderbolt 4 (до 40 Гбит/с), USB 4 (до 40 Гбит/с).
                
                - Видео
                
                Поддерживаемые форматы включают HEVC, H.264, AV1 и ProRes.
                
                HDR с Dolby Vision, HDR10+/HDR10 и HLG
                
                - Аудио
                
                Поддерживаемые форматы включают AAC, MP3, Apple Lossless, FLAC, Dolby Digital, Dolby Digital Plus и Dolby Atmos.
                
                Звуковая система с четырьмя динамиками
                
                Поддержка пространственного звука при воспроизведении музыки или видео с Dolby Atmos на встроенных динамиках
                
                Пространственное аудио с динамическим отслеживанием положения головы при использовании поддерживаемых моделей AirPods, AirPods Pro и AirPods Max 6
                
                Трехмикрофонная решетка с направленным формированием луча
                
                Режимы микрофона «Голосовая изоляция» и «Широкий спектр»
                
                Улучшенная четкость голоса при аудио- и видеозвонках
                
                Разъем для наушников 3,5 мм с расширенной поддержкой наушников с высоким сопротивлением
                
                - Камера
                
                12-мегапиксельная центральная камера с поддержкой режима Desk View
                
                Запись HD-видео 1080p
                
                Усовершенствованный процессор обработки сигналов изображений с вычислительным видео
                
                - Размер и вес
                
                Высота: 1,13 см
                Ширина: 30,41 см
                Глубина:  21,5 см
                Вес: 1,24 кг''',
    },
    {
        'title': 'Apple MacBook Air 13 M4 (2025) (Новый, не активирован) Ноутбук 13.6", Apple M4, RAM 16 ГБ, SSD 256 ГБ, Apple M4 GPU (8-core), MacOS, (MC6T4), голубой, Английская раскладка',
        'caption': '''
                    Удивительно лёгкий и тонкий, толщиной менее 1,5 см, MacBook Air легко впишется в ваш активный образ жизни — и в вашу сумку. MacBook Air с процессором M4 изготовлен более чем на 50% из переработанных материалов и имеет прочный корпус из переработанного алюминия.
                    Благодаря более быстрому нейронному движку в чипе M4 MacBook Air обладает еще более мощными возможностями ИИ, которые улучшают все, что вы делаете. От автоматического центрирования кадра камеры до масштабирования изображений с помощью ИИ и работы с новейшими большими языковыми моделями — вы будете продуктивнее и креативнее, чем когда-либо.
                    Клавиатура Magic Keyboard с подсветкой оснащена полноразмерными функциональными клавишами и Touch ID, что дает вам быстрый, простой и безопасный способ разблокировать компьютер Mac, войти в учетные записи и авторизовать платежи за покупки — и все это одним касанием пальца.
                    Дисплей Liquid Retina на MacBook Air поддерживает 1 миллиард цветов и имеет в 2 раза более высокое разрешение, чем у сопоставимых ноутбуков с ПК. Фотографии и видео отличаются высокой контрастностью и чёткостью, а текст выглядит очень чётким.
                    Оставайтесь в кадре во время видеозвонков, даже если вы двигаетесь или к вам присоединяются другие люди.
                    Зарядный кабель MagSafe крепится и отсоединяется с помощью магнита, предотвращая непреднамеренное отсоединение. Два порта Thunderbolt 4 позволяют подключать высокоскоростные аксессуары и заряжать Mac. Разъем для наушников поддерживает наушники с высоким импедансом. А Wi-Fi 6E обеспечивает в 2 раза более высокую пропускную способность по сравнению с Wi-Fi 6.''',
    },
    {
        'title': 'Apple MacBook Air Ноутбук 13.3", Apple M1 (3.2 ГГц), RAM 8 ГБ, SSD 256 ГБ, Apple M1, MacOS, (MGN63SA/A;MGN63HN/A), серый, Русская раскладка',
        'caption': '''Представляем вашему вниманию 13.3" Ноутбук Apple MacBook Air - идеальный выбор для тех, кто ценит качество и стиль. Устройство оснащено мощным процессором Apple M1 с частотой 3.2 ГГц и 8 ядрами, что обеспечивает высокую производительность при работе с любыми задачами.

                    Ноутбук имеет оперативную память объемом 8 ГБ и SSD накопитель на 256 ГБ, что позволяет быстро запускать программы и работать с большими файлами без проблем. Диагональ экрана составляет 13.3 дюйма с разрешением 2560x1600 пикселей, что гарантирует яркое и четкое изображение.
                    
                    13.3" Apple MacBook Air оснащен модулем связи WiFi 802.11 a/b/g/n/ac/ax, который позволяет подключаться к сети Wi-Fi на расстоянии до 10 метров. Также он имеет три порта Thunderbolt 3, что обеспечивает быструю передачу данных и возможность использования внешних устройств.
                    
                    Данная модель - отличный выбор для тех, кто хочет получить качественный и надежный компьютер с высокой производительностью и удобной клавиатурой. Она будет полезна как для работы, так и для игр или просмотра фильмов.''',
    },
    {
        'title': 'Apple MacBook Pro 14 Ноутбук 14.2", Apple M3 (8 CPU, 10 GPU), RAM 8 ГБ, SSD 512 ГБ, Apple M3, MacOS, (MTL73CH/A), серый, Английская раскладка',
        'caption': '''Ноутбук Apple MacBook Pro 14 - это мощное устройство, которое сочетает в себе высокую производительность и стильный дизайн. Этот ноутбук оснащен процессором Apple M3 с частотой 4.1 ГГц и 8 ядрами, что обеспечивает быструю работу приложений и игр. Оперативная память объемом 8 ГБ позволяет запускать множество программ одновременно без замедления работы системы.
            Видеокарта Apple M3 обеспечивает отличную графическую производительность, а технология Liquid Retina XDR гарантирует яркий и четкий изображение на экране диагональю 14.2 дюйма с разрешением 3024x1964 пикселей.
            Ноутбук Apple MacBook Pro 14 оснащен модулем связи WiFi 802.11ax, который обеспечивает быстрый доступ в интернет. Также он имеет два порта Thunderbolt 4 для подключения внешних устройств и расширения возможностей ноутбука.
            Этот ноутбук - идеальный выбор для тех, кто ищет мощное устройство с высокой производительностью и стильным дизайном. Он будет полезен как для профессионалов, так и для студентов и любителей компьютерных игр.''',
    },
]

query= {
    'title': "Восстановленный Apple Смартфон iPhone 13 4/256 ГБ, белый",
    'caption':'''В современном мире технологии развиваются с невероятной скоростью, и рынок мобильных устройств не исключение. Среди множества моделей смартфонов особое место занимает iPhone 13, который был выпущен в конце 2021 года и до сих пор остаётся актуальным.

        iPhone 13 — это отличный выбор для тех, кто ищет мощный и функциональный смартфон. Он оснащён передовыми технологиями и функциями, которые делают его идеальным выбором для повседневного использования.
        
        Основные характеристики iPhone 13:
        
        Безрамочный дизайн с Face ID;
        
        Неплохая камера, которая хорошо снимает днём и вечером;
        
        Поддержка магнитных аксессуаров MagSafe;
        
        Мощный процессор A15 Bionic, который обеспечивает быструю и плавную работу;
        
        Доступ к обновлениям iOS до 2026–2027 года.
        
        Если вы ищете надёжный и функциональный смартфон, который будет служить вам верой и правдой долгие годы, то iPhone 13 — отличный выбор. Он подойдёт как для повседневного использования, так и для выполнения более сложных задач.
        
        Для большинства пользователей iPhone 13 будет отличным выбором. Он обладает всеми необходимыми функциями и характеристиками, чтобы удовлетворить потребности современного пользователя.
        
        Если же Вам нужен телефон для фото видео съемки, но хотите вписаться в рамки бюджета, то рекомендую посмотреть серию PRO, это то, с чем можно оставить любую отечественную студию не удел, и всего одним устройством.'''
}

